<a href="https://colab.research.google.com/github/GilbertRPG/CodingDojo/blob/main/GroupByChallenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [281]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [282]:
import pandas as pd

In [283]:
df = pd.read_csv('https://raw.githubusercontent.com/mGalarnyk/Tutorial_Data/master/Pandas/CalIt2.data', header = None) # shoutout to jia_li in Mattermost for pinning this solution! Learn something new every day!
df.head()

   0         1         2  3
0  7  07/24/05  00:00:00  0
1  9  07/24/05  00:00:00  0
2  7  07/24/05  00:30:00  1
3  9  07/24/05  00:30:00  0
4  7  07/24/05  01:00:00  0

In [284]:
df.info() # See what kind of dtype is in each column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10080 entries, 0 to 10079
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       10080 non-null  int64
 1   1       10080 non-null  object
 2   2       10080 non-null  object
 3   3       10080 non-null  int64
dtypes: int64(2), object(2)
memory usage: 315.1+ KB

In [285]:
df.columns=['Flow_ID', 'Date', 'Time', 'Count'] # Rename the columns to the strings given.
df.head()

   Flow_ID      Date      Time  Count
0        7  07/24/05  00:00:00      0
1        9  07/24/05  00:00:00      0
2        7  07/24/05  00:30:00      1
3        9  07/24/05  00:30:00      0
4        7  07/24/05  01:00:00      0

In [286]:
FlowID7 = df['Flow_ID'] == 7
SelectedDate = df['Date'] == '07/24/05'
df_grouping = df.loc[FlowID7 & SelectedDate] # Filters df by the predefinied filtered datasets above this line.

In [287]:
df_grouping.head(10) # Verify the change was correct.

    Flow_ID      Date      Time  Count
0         7  07/24/05  00:00:00      0
2         7  07/24/05  00:30:00      1
4         7  07/24/05  01:00:00      0
6         7  07/24/05  01:30:00      0
8         7  07/24/05  02:00:00      0
10        7  07/24/05  02:30:00      2
12        7  07/24/05  03:00:00      0
14        7  07/24/05  03:30:00      0
16        7  07/24/05  04:00:00      0
18        7  07/24/05  04:30:00      0

In [288]:
top10 = df_grouping.sort_values(by=['Count'], ascending= False).head(10) #here we're defining that we only want the top 10 vaules
top10

    Flow_ID      Date      Time  Count
72        7  07/24/05  18:00:00      4
84        7  07/24/05  21:00:00      3
76        7  07/24/05  19:00:00      2
92        7  07/24/05  23:00:00      2
30        7  07/24/05  07:30:00      2
10        7  07/24/05  02:30:00      2
86        7  07/24/05  21:30:00      2
70        7  07/24/05  17:30:00      2
68        7  07/24/05  17:00:00      1
74        7  07/24/05  18:30:00      1

In [289]:
LowestVaule = top10['Count'].min() #this is where we grab the lowest vaule of the top 10 and set it to a variable

In [290]:
def subtract(x): # here is where we define the function before we start the GroupBy.apply section because the groupby needs a function!!!!!!!!!
    return x - LowestVaule

In [291]:
ApplyToStuff = top10['Count'].apply(subtract) # apply the subtraction function to the whole top10 list and then assign the output a variable

In [292]:
ApplyToStuff.mean() # gets the meeeeeean (average vaule of resulting counts)

1.1

In [293]:
# df['Date'] = pd.to_datetime(df['Date'])

In [294]:
df.info

<bound method DataFrame.info of        Flow_ID      Date      Time  Count
0            7  07/24/05  00:00:00      0
1            9  07/24/05  00:00:00      0
2            7  07/24/05  00:30:00      1
3            9  07/24/05  00:30:00      0
4            7  07/24/05  01:00:00      0
...        ...       ...       ...    ...
10075        9  11/05/05  22:30:00      0
10076        7  11/05/05  23:00:00      0
10077        9  11/05/05  23:00:00      0
10078        7  11/05/05  23:30:00      1
10079        9  11/05/05  23:30:00      0

[10080 rows x 4 columns]>

In [295]:
FlowID7 = df['Flow_ID'] == 7
SelectedDateHigh = df['Date'] >= '08/01/05'
SelectedDateLow = df['Date'] <= '08/31/05'
df_grouping = df.loc[FlowID7 & SelectedDateLow & SelectedDateHigh]
df_grouping

      Flow_ID      Date      Time  Count
768         7  08/01/05  00:00:00      1
770         7  08/01/05  00:30:00      0
772         7  08/01/05  01:00:00      0
774         7  08/01/05  01:30:00      0
776         7  08/01/05  02:00:00      0
...       ...       ...       ...    ...
3734        7  08/31/05  21:30:00      0
3736        7  08/31/05  22:00:00      2
3738        7  08/31/05  22:30:00      1
3740        7  08/31/05  23:00:00      0
3742        7  08/31/05  23:30:00      2

[1488 rows x 4 columns]

In [296]:
df_grouping.groupby(['Date', 'Flow_ID'])[['Count']].max() # this is important! (['Stuff that I want to display'])[['the thing i want to do something to]].max()

                  Count
Date     Flow_ID
08/01/05 7           18
08/02/05 7           16
08/03/05 7           26
08/04/05 7           40
08/05/05 7           17
08/06/05 7            8
08/07/05 7            3
08/08/05 7           16
08/09/05 7           19
08/10/05 7           25
08/11/05 7           16
08/12/05 7           21
08/13/05 7            5
08/14/05 7            3
08/15/05 7           17
08/16/05 7           24
08/17/05 7           22
08/18/05 7           39
08/19/05 7           23
08/20/05 7            3
08/21/05 7            4
08/22/05 7           23
08/23/05 7           25
08/24/05 7           17
08/25/05 7           24
08/26/05 7           22
08/27/05 7            3
08/28/05 7            7
08/29/05 7           15
08/30/05 7           47
08/31/05 7           19